### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

In [2]:
#File to Load
#schools csv
schools_csv = "Resources/schools_complete.csv"
school_df = pd.read_csv(schools_csv)

In [3]:
#Look at column names
school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
#students csv
students_csv = "Resources/students_complete.csv"
students_df = pd.read_csv(students_csv)

In [5]:
#Look at column names
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
#make a table with the schools and students dataframes
merge_df = pd.merge(school_df, students_df, on="school_name")
merge_df

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
...,...,...,...,...,...,...,...,...,...,...,...
39165,14,Thomas High School,Charter,1635,1043130,39165,Donna Howard,F,12th,99,90
39166,14,Thomas High School,Charter,1635,1043130,39166,Dawn Bell,F,10th,95,70
39167,14,Thomas High School,Charter,1635,1043130,39167,Rebecca Tanner,F,9th,73,84
39168,14,Thomas High School,Charter,1635,1043130,39168,Desiree Kidd,F,10th,99,90
39169,14,Thomas High School,Charter,1635,1043130,39169,Carolyn Jackson,F,11th,95,75

In [7]:
#Calculate the number of schools
school_count = len(merge_df["school_name"].unique())
school_count

15

In [8]:
#Calculate the number of students
student_count = merge_df["student_name"].count()
student_count

39170

In [9]:
#Calculate the total budget
district_budget = merge_df["budget"].sum()
district_budget

82932329558

In [10]:
#Calculate the average math score
av_math_score = merge_df["math_score"].mean()
av_math_score

78.98537145774827

In [11]:
#Calculate the average reading score
av_reading_score = merge_df["reading_score"].mean()
av_reading_score

81.87784018381414

In [12]:
#Percentage of students passing math

#find the number of students with a math score 70 or over
math_pass_count = merge_df[(merge_df["math_score"] >= 70)].count()["student_name"]

#number of passing math students/total students
math_pass_percentage = math_pass_count/ (student_count) * 100

math_pass_percentage

74.9808526933878

In [13]:
#Percentage of students passing reading

reading_pass_count = merge_df[(merge_df["reading_score"] >= 70)].count()["student_name"]
reading_pass_percentage = reading_pass_count/ (student_count) * 100

reading_pass_percentage

85.80546336482001

In [14]:
#Percentage overall passing
overall_pass_count = merge_df[(merge_df["reading_score"] >= 70) & (merge_df["math_score"] >= 70)].count()["student_name"]


overall_pass_percentage = overall_pass_count/ (student_count) * 100

overall_pass_percentage

65.17232575950983

In [15]:
# add the new columns to the table and clean up the column names
district_summary = pd.DataFrame({"Total Schools": [school_count],
                                 "Total Students": [student_count],
                                 "Total Budget": [district_budget],
                                 "Average Math Score": [av_math_score],
                                 "Average Reading Score": [av_reading_score],
                                 "% of Students Passing Math": [math_pass_percentage],
                                 "% of Students Passing Reading": [reading_pass_percentage],
                                 "% of Students Passing Overall": [overall_pass_percentage]
                                })  

district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% of Students Passing Math,% of Students Passing Reading,% of Students Passing Overall
0,15,39170,82932329558,78.985371,81.87784,74.980853,85.805463,65.172326

In [16]:
#make a table grouped by school name that shows the same info as above for each school
school_types = merge_df.groupby("school_name")["type"].apply(list).reset_index(name="school_type")
school_types

              school_name                                        school_type
0      Bailey High School  [District, District, District, District, Distr...
1     Cabrera High School  [Charter, Charter, Charter, Charter, Charter, ...
2    Figueroa High School  [District, District, District, District, Distr...
3        Ford High School  [District, District, District, District, Distr...
4     Griffin High School  [Charter, Charter, Charter, Charter, Charter, ...
5   Hernandez High School  [District, District, District, District, Distr...
6      Holden High School  [Charter, Charter, Charter, Charter, Charter, ...
7       Huang High School  [District, District, District, District, Distr...
8     Johnson High School  [District, District, District, District, Distr...
9        Pena High School  [Charter, Charter, Charter, Charter, Charter, ...
10  Rodriguez High School  [District, District, District, District, Distr...
11    Shelton High School  [Charter, Charter, Charter, Charter, Charter, ...
12     Thomas High School  [Charter, Charter, Charter, Charter, Charter, ...
13     Wilson High School  [Charter, Charter, Charter, Charter, Charter, ...
14     Wright High School  [Charter, Charter, Charter, Charter, Charter, ...

In [17]:
#sum the number of times a school appears in the table, each row is one student
total_students_by_school = merge_df["school_name"].value_counts()
total_students_by_school

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [46]:
#get the budget for each school and then the buget per student
school_budget = merge_df.groupby(["school_name"]).mean()["budget"]
school_budget_per_capita = school_budget / total_students_by_school

school_budget_per_capita

Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [19]:
#average math score by school
av_math_score_by_school = merge_df.groupby(["school_name"]).mean()["math_score"]

In [20]:
#average reading score by school
av_reading_score_by_school = merge_df.groupby(["school_name"]).mean()["reading_score"]

In [21]:
#number of students passing math, reading, and passing overall
math_pass_by_school = merge_df[(merge_df["math_score"] >= 70)]
reading_pass_by_school = merge_df[(merge_df["reading_score"] >= 70)]

overall_pass_by_school = merge_df[(merge_df["math_score"] >= 70) & (merge_df["reading_score"] >= 70)]

In [22]:
#get the math, reading, and overall passing percentages by school
math_pass_percent_by_school =math_pass_by_school.groupby(["school_name"]).count()["student_name"] / total_students_by_school * 100

In [23]:
reading_pass_percent_by_school =reading_pass_by_school.groupby(["school_name"]).count()["student_name"] / total_students_by_school * 100

In [24]:
overall_pass_percent_by_school =overall_pass_by_school.groupby(["school_name"]).count()["student_name"] / total_students_by_school * 100

In [25]:
#make the school info dataframe
school_info = pd.DataFrame({"School Name": [school_types],
                            "Total Students": [total_students_by_school],
                            "Total Budget": [district_budget],
                            "Spending per Capita": [school_budget_per_capita],
                            "Average Math Score": [av_math_score],
                            "Average Reading Score": [av_reading_score],
                            "% of Students Passing Math": [math_pass_percentage],
                            "% of Students Passing Reading": [reading_pass_percentage],
                            "% of Students Passing Overall": [overall_pass_percentage]
                                })  



#Clean Up
school_info = school_info[["School Name","Total Students", "Total Budget", "Spending per Capita", "Average Math Score","Average Reading Score", "% of Students Passing Math", "% of Students Passing Reading","% of Students Passing Overall"]]
school_info

,School Name,Total Students,Total Budget,Spending per Capita,Average Math Score,Average Reading Score,% of Students Passing Math,% of Students Passing Reading,% of Students Passing Overall
0,school_name ...,Bailey High School 4976 Johnson High Sch...,82932329558,Bailey High School 628.0 Cabrera High Sc...,78.985371,81.87784,74.980853,85.805463,65.172326

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

In [26]:
#show the top 5% of schools
top_schools = school_info.sort_values(["% of Students Passing Overall"], ascending=False)
top_schools

,School Name,Total Students,Total Budget,Spending per Capita,Average Math Score,Average Reading Score,% of Students Passing Math,% of Students Passing Reading,% of Students Passing Overall
0,school_name ...,Bailey High School 4976 Johnson High Sch...,82932329558,Bailey High School 628.0 Cabrera High Sc...,78.985371,81.87784,74.980853,85.805463,65.172326

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

In [27]:
#show the bottom 5% of schools
bottom_schools = school_info.sort_values(["% of Students Passing Overall"], ascending=True)
bottom_schools

,School Name,Total Students,Total Budget,Spending per Capita,Average Math Score,Average Reading Score,% of Students Passing Math,% of Students Passing Reading,% of Students Passing Overall
0,school_name ...,Bailey High School 4976 Johnson High Sch...,82932329558,Bailey High School 628.0 Cabrera High Sc...,78.985371,81.87784,74.980853,85.805463,65.172326

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [28]:
#separate out the grades
ninth_grade = merge_df[(merge_df["grade"] =="9th")]
tenth_grade = merge_df[(merge_df["grade"] =="10th")]
eleventh_grade = merge_df[(merge_df["grade"] =="11th")]
twelfth_grade = merge_df[(merge_df["grade"] =="12th")]

In [29]:
#group each series by school and get the average math scores
ninth_grade_by_schools = ninth_grade.groupby(["school_name"]).mean()["math_score"]
tenth_grade_by_schools = tenth_grade.groupby(["school_name"]).mean()["math_score"]
eleventh_grade_by_schools = eleventh_grade.groupby(["school_name"]).mean()["math_score"]
twelfth_grade_by_schools = twelfth_grade.groupby(["school_name"]).mean()["math_score"]

In [42]:
scores_by_grade = pd.DataFrame({"9th": ninth_grade_by_schools,
                                "10th": tenth_grade_by_schools,
                                "11th": eleventh_grade_by_schools,
                                "12th": twelfth_grade_by_schools
                
})

scores_by_grade.sort_values("12th")

                             9th       10th       11th       12th
school_name
Huang High School      81.290284  81.512386  81.417476  80.305983
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Ford High School       80.632653  81.262712  80.403642  80.662338
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Bailey High School     81.303155  80.907183  80.945643  80.912451
Johnson High School    81.260714  80.773431  80.616027  81.227564
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Griffin High School    83.369193  83.706897  84.288089  84.013699
Wright High School     83.833333  83.812757  84.156322  84.073171
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Wilson High School     83.939778  84.021452  83.764608  84.317673
Pena High School       83.807273  83.612000  84.335938  84.591160
Holden High School     83.677165  83.324561  83.815534  84.698795

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [31]:
#group each series by school and get the average reading scores
ninth_grade_by_schools = ninth_grade.groupby(["school_name"]).mean()["reading_score"]
tenth_grade_by_schools = tenth_grade.groupby(["school_name"]).mean()["reading_score"]
eleventh_grade_by_schools = eleventh_grade.groupby(["school_name"]).mean()["reading_score"]
twelfth_grade_by_schools = twelfth_grade.groupby(["school_name"]).mean()["reading_score"]

In [41]:
scores_by_grade = pd.DataFrame({"9th": ninth_grade_by_schools,
                                "10th": tenth_grade_by_schools,
                                "11th": eleventh_grade_by_schools,
                                "12th": twelfth_grade_by_schools
                
})

scores_by_grade.sort_values("12th")

                             9th       10th       11th       12th
school_name
Huang High School      81.290284  81.512386  81.417476  80.305983
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Ford High School       80.632653  81.262712  80.403642  80.662338
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Bailey High School     81.303155  80.907183  80.945643  80.912451
Johnson High School    81.260714  80.773431  80.616027  81.227564
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Griffin High School    83.369193  83.706897  84.288089  84.013699
Wright High School     83.833333  83.812757  84.156322  84.073171
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Wilson High School     83.939778  84.021452  83.764608  84.317673
Pena High School       83.807273  83.612000  84.335938  84.591160
Holden High School     83.677165  83.324561  83.815534  84.698795

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [33]:
#bins for school spending- based on per capita spending
# less than $600
# $600-$629
# $630-$649
# $650 and over
spending_bins = [0, 599, 630, 649, 700]
group_names = ["<$600", "$600-$629", "$630-$649", ">=$650"]

In [34]:
#apply the bins to the data frame with the school spending, and average scores & reading rates
#do this witha a back up copy
school_spending_df = school_info

In [35]:
#separate the schcool_info df into the bins
school_spending_df["Spending by Student"] = pd.cut(school_budget_per_capita,spending_bins, labels = group_names, right = False)
school_spending_df

,School Name,Total Students,Total Budget,Spending per Capita,Average Math Score,Average Reading Score,% of Students Passing Math,% of Students Passing Reading,% of Students Passing Overall,Spending by Student
0,school_name ...,Bailey High School 4976 Johnson High Sch...,82932329558,Bailey High School 628.0 Cabrera High Sc...,78.985371,81.87784,74.980853,85.805463,65.172326,NaN

## Scores by School Size

* Perform the same operations as above, based on school size.

In [36]:
#bins for school spending- based on number of students
#less than 1,000
# 1,000 to 1,999
# 2,000-2,999
# $3,000 and over
student_bins = [0, 1000, 1999, 2999, 3000]
group_names = ["<1,000", "1,000 to 1,999", "$2,000 to $2,999", ">=$3,000"]

#apply the bins to the data frame with the school spending, and average scores & reading rates
#do this witha a back up copy
school_size_df = school_info

#separate the schcool_info df into the bins
school_size_df["Spending by Student"] = pd.cut(total_students_by_school,spending_bins, labels = group_names, right = False)
school_size_df

,School Name,Total Students,Total Budget,Spending per Capita,Average Math Score,Average Reading Score,% of Students Passing Math,% of Students Passing Reading,% of Students Passing Overall,Spending by Student
0,school_name ...,Bailey High School 4976 Johnson High Sch...,82932329558,Bailey High School 628.0 Cabrera High Sc...,78.985371,81.87784,74.980853,85.805463,65.172326,NaN

## Scores by School Type

* Perform the same operations as above, based on school type

In [37]:
#try group by
type_math_score = school_info.groupby(["School Type"]).mean()["Average Math Score"]
type_reading_score = school_info.groupby(["School Type"]).mean()["Average Reading Score"]
type_pc_math = school_info.groupby(["School Type"]).mean()["% of Students Passing Math"]
type_pc_reading = school_info.groupby(["School Type"]).mean()["% of Students Passing Reading"]
type_pc_overall = school_info.groupby(["School Type"]).mean()["% of Students Passing Overall"]

In [38]:
#Make a dataframe from the type info
type_summary = pd.DataFrame({"Average Math Score": type_math_score,
                              "Average Reading Score": type_reading_score,
                              "% Passing Math": type_pc_math,
                              "% Passing Reading": type_pc_reading,
                              "% Passing Overall": type_pc_overall})

type_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Passing Overall
School Type,78.985371,81.87784,74.980853,85.805463,65.172326